Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G65A.tmx
Source language: en_us
Languages: zh_cn

source: A Billion Stories
zh_cn: 十亿个故事

source: In my neighborhood, near the Lama Temple, the men and women in fluorescent orange jumpsuits work for the district sanitation department.
zh_cn: 在我住的地方附近，挨着雍和宫，能看见穿着荧光橘颜色连衣裤的男男女女，他们是小区环保部门的人。

source: Many are migrant workers from the countryside; they sweep the alleys, clean the public restrooms, and collect the trash.
zh_cn: 许多是外来的农民工；打扫胡同，清洁公厕，收集垃圾。

source: Some wear straw farmers' hats that cast a shadow across their faces, and, I admit, the matching uniforms make it difficult for me to keep them straight. I don't know if there are three of them or thirty.
zh_cn: 他们中一些人戴着农民的草帽，在脸上投下一片阴影，而且我不得不说，那一致的着装让我分不清他们一群人是有三个还是三十个。

source: One afternoon not long ago, I was chatting with my next-door neighbor, a retiree named Huang Wenyi-a proud Beijinger, born and raised-when one of the sweepers in an orange jumpsuit wandered by. He had tousled hair, sun wrinkles around his eyes, and a smile of jumbled teeth.
zh_cn: 不久前的一个下午，我和我的邻居在街边聊天，他叫黄文艺，已经退休了，是个土生土长的自豪的北京人。这时，一个身着荧光橘色连体服的清洁工从我们身旁经过，一头乱发，眼周布满皱纹，笑起来露出乱七八糟的牙齿。

source: He approached and pointed to a gray flagstone at our feet. "Can you see the emperor on that rock?" the sweeper asked.
zh_cn: 他靠近我们并指着我们脚下的一块石板，问：“你能看见石头上的皇帝吗？

source: I thought I'd misheard.
zh_cn: 我以为我听错了。

source: He said, "I can see an image of the emperor right there on that rock."
zh_cn: 他又说道，“我能看见那石头上有皇帝的图像。”

source: Huang and I looked at the rock and back at the sweeper.
zh_cn: 黄文艺和我看看石头又看了看那位清洁工。

source: Huang was not interested.
zh_cn: 黄显得并不感兴趣。

source: "What are you bullshitting about?" he asked. "You have no idea what you're talking about."
zh_cn: “你在胡说什么？”，黄问他，“你不知道自己在说些什么。”

source: The sweeper smiled and asked, "Are you saying you think I'm not a cultured man?"
zh_cn: 清洁工笑起来，问：“你的意思是觉得我不是个文化人？”

source: "What I'm saying," Huang said, "is that you're not making sense."
zh_cn: “我的意思是，”黄文艺说道，“你在胡说八道。”

source: The sweeper gave him a look, and turned, instead, to face me.
zh_cn: 清洁工看了他一眼，转过脸又看着我。

source: "I can look at anything, and pull the essence from it," he said. "It doesn't matter how ordinary something is; in my eyes, it becomes a treasure.
zh_cn: “我会看任何东西，能看出其中的本质”，他说，“不管是多普通的东西；在我眼里都是个宝。

source: Do you believe me?"
zh_cn: 你相信吗？”

source: Huang was irritated: "Old man, I'm trying to have a chat with our foreign friend here.
zh_cn: 黄文艺有些生气：“老人家，我正和我的外国朋友聊天。

source: Can you not disturb us, and go back to your work?"
zh_cn: 你能回去工作别打扰我们吗？”

source: The sweeper kept talking-faster now, about ancient Chinese poetry, and the great modern writer Lu Xun-some of it too fast, and the references too obscure, for me to understand.
zh_cn: 清洁工却继续在说，说得比刚刚更快了，他提起中国古诗和伟大的现代作家鲁迅，因为有的地方说得太快，内容也太抽象，我不太明白。

source: He sounded somewhere between interesting and bonkers.
zh_cn: 他听起来像是个有意思的人，也像是个精神不正常的人。

source: Huang had had enough, and he poked fun at the man's countryside accent. "Come back after you've learned to speak Beijing dialect," he said.
zh_cn: 黄不耐烦了，取笑起他的农村口音来：“学好怎么讲北京话再回来吧。”

source: Under his breath, the sweeper said, "As long as it's a dialect of human beings, it's legitimate."
zh_cn: 只听清洁工小声说道，“只要是属于人类的方言，就有存在的道理。”

source: But Huang didn't hear him. He'd waved him away and wandered into his house.
zh_cn: 但是黄没有听见，摆摆手示意他走开，然后自己回到屋里去了。

source: I introduced myself. The sweeper's name was Qi Xiangfu.
zh_cn: 互相自我介绍后，我知道了这个清洁工名叫戚相富，是江苏人。

source: He was from Jiangsu Province, and he said he had come to Beijing three months ago.
zh_cn: 他说三个月前来的北京。

source: Why did you come, I asked.
zh_cn: 我问他为什么要来。

source: "To explore the realm of culture," he said grandly.
zh_cn: “为了考察文化界”，他大气地说。

source: "What kind of culture?"
zh_cn: “什么样的文化？”

source: "Poetry, mainly. Ancient Chinese poetry.
zh_cn: “主要是诗歌，中国古代诗歌。

source: During the Tang Dynasty, when poetry was the best, every poet wanted to come to Chang'an," he said, invoking the name of the ancient capital, the predecessor to Beijing.
zh_cn: 在唐朝诗歌最兴盛的时候，每个诗人都想去长安，”他说道，引用了这个北京之前的古都的旧名。

source: "I wanted a bigger stage," he said. "It doesn't matter whether I succeed or fail.
zh_cn: “我想要一个更大的平台，成功失败都无所谓。

source: I'm here. That's what matters."
zh_cn: 我来了，就行了。”

source: It was getting late; before I went inside, Qi said he had competed in poetry competitions.
zh_cn: 天渐渐变晚。我要回屋之前，戚相富说他参加过诗歌比赛。

source: "I won the title of 'Super King of Chinese Couplets.'?"
zh_cn: “我得过‘超级对联王’的称号。”

source: In his spare time, he had taken to hosting an online forum about modern Chinese poetry.
zh_cn: 他在闲暇时间里热衷于主持一个关于中国现代诗歌的网络论坛。

source: "You can go online and read about me," he said.
zh_cn: “你可以上网了解一下我，”他说。

source: That night, I typed his name into the Web, and there he was: Qi Xiangfu, the Super King of Chinese Couplets.
zh_cn: 那天晚上我上网输入了他的名字，然后便看见了他：戚相富，超级对联王。

source: In the photo, he was handsomely dressed in a bow tie and a jacket; he looked young and confident.
zh_cn: 照片上他戴着领结，穿着夹克，一副潇洒的模样，看起来年轻自信。

source: Chinese poems are hard for me to understand, and many of his, especially, were impenetrably weird.
zh_cn: 中国诗歌对我来说本来就非常难懂，特别是戚相富的一些诗，又格外古怪。

source: But I appreciated some moments of grace: "Earth knows the lightness of our feet," he wrote. "We meet each other there?/?Between heaven and earth."
zh_cn: 不过某些优雅的部分我还是欣赏到了，“大地知晓你我脚下的光，”他写道，“在天地之间/我们彼此需要。”

source: To my surprise, the more I searched about Qi Xiangfu, the more I found of a life lived partly online.
zh_cn: 出乎我意料的是，越多地搜索戚相富，我就越多地发现了他在网络的生活部分。

source: He once wrote a short memoir, in which he described himself in the third person, with the formality usually reserved for China's most famous writers.
zh_cn: 他曾写过一篇短的回忆录，用的是第三人称的写法，一种专为中国最著名作家所用的形式。

source: He wrote that his father died young, and Qi was raised by his uncle.
zh_cn: 他写道他的父亲早逝，自己被叔叔抚养长大。

source: He wrote, of himself, "The first time Qi read Mao's poem 'The Long March,' he resolved that Mao would be the teacher to show him the way.
zh_cn: 他写自己“戚第一次读毛泽东的‘长征’一诗便决定毛就是将为自己指明前路的老师。

source: Later, he studied the poetry of Li Bai, Du Fu, Su Dongpo, Lu You, and others, and he made a promise to himself: Become a master of literature."
zh_cn: 随后他研究了李白、杜甫、苏东坡、陆游和其他人的作品，并对自己许诺要成为一个文学大师。”

source: He described the first time he ever presented one of his poems to a large group-it was played on a speaker at a construction site-and he described a bus trip in which he met, as he put it, "a girl who sympathized."
zh_cn: 他写道他第一次把自己的诗公之于众是在一个建筑工地的扬声器里播放，他还在一次汽车旅途中遇到一个女孩，如他所写，“知音”，于是他们结了婚，“结束了他的漂泊。”

source: They married and it "ended his life of vagrancy." There were hints of trouble in his life-at one point, he wrote a plea for donations, saying, "Alas, Comrade Qi is having a difficult time"-but something in the spirit of his online persona captivated me.
zh_cn: 也有暗示他生活中坎坷的描写，在某一处他写了一个呼吁捐款的请愿：“唉，戚同志日子不好过啊”——尽管如此，他在网络上的人格里的精神中的某些东西还是吸引了我。

source: So much of it was impossible just a few years ago: the journey to the city, the online identity, the interior life so at odds with the image he projected to the world.
zh_cn: 再早几年，这么多事情都是不可能发生的，什么城市之旅，网络身份，与外在形象截然不同的内心独白。

source: When I first studied in China, seventeen years ago, the Internet was only a distant rumor. It had reached China two years earlier, but hardly anyone had access.
zh_cn: 我17年前第一次来中国学习的时候，互联网只是个遥远的传说，虽然在那之前的早两年中国也以已经有了互联网，但几乎没有人能够使用。

source: When I brought a modem from the U.S., and tried to plug it into my dorm-room wall in Beijing, the machine emitted a sickly popping sound and never stirred again.
zh_cn: 当我把从美国带来的“猫”插到我在北京的宿舍墙上时，机器发出微弱的砰砰声，然后就再也没有反应了。

source: When I moved to Beijing, in 2005, to write, I was accustomed to hearing the story of China's transformation told in vast, sweeping strokes-involving one fifth of humanity, and great pivots of politics and economics.
zh_cn: 2005年我搬到北京开始写作的时候，已经对关于中国发展变化的故事如雷贯耳，比如拥有世界上五分之一的人口，和崛起的政治经济枢纽。

source: But, over the next eight years, some of the deepest changes in the lives around me have been intimate and perceptual, buried in daily rhythms that are easy to overlook.
zh_cn: 而在接下来的八年中，发生在我周围生活中的某些看得见摸得着的深刻变化，埋葬在日常生活的节奏里，渐渐被忽视。

source: A generation ago, foreigners writing about China marvelled most at the sameness of it all.
zh_cn: 上个时代前，外国人写中国总是惊异于它所有一切的千篇一律性。

source: Chairman Mao was the "Emperor of the Blue Ants," as a memorable book title had it.
zh_cn: 就像一个难忘的书名所示，毛主席是“蓝蚁帝王”。

source: But in my years in China, I have been seized most of all by the sense that the national narrative, once an ensemble performance, is splintering into a billion stories.
zh_cn: 但我在中国的多年里，最抓住我的却是它的国家记事，曾是集体书写的记叙长文，正在分裂成十亿个故事。

source: Living in China at this moment, the stories bombard you with such fantastical vividness that you can't help but write them down and hope to make sense of them later.
zh_cn: 眼下生活在中国，所有击中你的奇妙生动的故事使你只想记录下来，至于意义则是日后之事。

source: Writing about China, in The New Yorker, for the past five years, I've tried to capture something of this age, to grab a few of these stories out of the air before they slip by.
zh_cn: 为纽约客写关于中国的文章的过去五年里，我努力尝试抓住这个时代的某些东西，尝试从周围生活中攫取几个飞掠而过的故事。

source: The complexities of individual lives blunt the impulse to impose a neat logic on them, and nobody who stays here for some time remains certain about too much for too long.
zh_cn: 个体生活的复杂多变令人难以赋予其完整的逻辑性，而没有几个在这里待过一段时间的人还能对世事保持太久的确定态度。

source: To impose order on the changes, we seek refuge, of a kind, in statistics.
zh_cn: 为了给变化施加次序，我们求助于统计数据。

source: In my years here, the number of airline passengers nationwide doubled; sales of personal computers and cell phones tripled. The length of the Beijing subway quadrupled.
zh_cn: 我在中国的时间里，乘坐飞机的人数全国范围内增加了一倍；个人电脑和手机的销量增加了两倍；北京地铁的长度增加了三倍。

source: But the longer I stayed, the less those impressed me than the dramas that I could never quantify at all.
zh_cn: 而我待得越久，这些数字给我的冲击就越淡，不及那些我无法量化的戏剧性故事来得强烈。

source: On Sunday, my wife, Sarabeth, and I are flying out.
zh_cn: 我和妻子Sarabeth将在星期天离开中国。

source: I'll be on leave for the next couple of months, wrapping up a book about a few individuals I've come to know in China. It will be published next spring, and I'll be saying more about that later.
zh_cn: 接下来几个月是我的假期，期间我会完成一本书，记录我在中国认识的几个人，预计在明年春天面世，届时我会再多做说明。

source: I'll resume writing for the magazine this fall, based in Washington, D.C. China is not leaving my blood stream; I'll be back to write pieces, and, in between, I'll be writing at Daily Comment and elsewhere about how China looks from afar.
zh_cn: 今年秋天我会在华盛顿继续写专栏。中国已在我的血流里，不会离开，我会继续写文章，而且中间我也会在每日评论或其它地方写我在远方看着的中国。

source: Since we launched this blog, in January of 2009, I've written about five hundred posts.
zh_cn: 从2009年1月开设这个博客起，我已经发表了500篇文章。

source: This will be the last for a while, and I want to thank you for visiting over the years.
zh_cn: 本篇将是一段时间内的最后一文，我想感谢你们这些年来的关注和阅读。

source: There will be much more to come on China on this site, and in the magazine, so I won't pretend to sum things up.
zh_cn: 网站将会有更多关于中国的文章，在杂志上也是，所以我也不会假装就这么总结完毕了。

source: For now, I'll mention only the fact that returns to me more often, perhaps, than any other: never in modern history has China been more prosperous and functional and connected with the world-and yet, it is the only country in the world with a winner of the Nobel Peace Prize in prison.
zh_cn: 此刻，我只想提及一个比其它任何事实都更反复萦绕在我脑海的事实：现代历史中，中国从未像今天这样繁荣、实用以及与世界紧密联系过，然而它却是世界上唯一一个把诺贝尔奖获得者留在监狱中的国家。

source: Contradictions like that have been the essence of this moment.
zh_cn: 这样的对比便是当前的本质。

source: After I met the street sweeper Qi Xiangfu, I started bumping into him frequently.
zh_cn: 自打见过清洁过戚相富第一面，此后我就常常遇见他。

source: We swapped phone numbers, and he would send me a poem, now and then, by text message.
zh_cn: 我们交换了手机号，他时不时用短信发给我他写的诗。

source: He typed out the characters on his phone, with the help of a magnifying glass to aid his eyes.
zh_cn: 他在放大镜的帮助下，在手机上一个个打出汉字。

source: Many of his poems were heavy with Communist fervor; others were oracular and strange.
zh_cn: 他的许多诗都饱含共产主义热情，其它的则玄妙又奇怪。

source: But I sympathize with anyone trying to make sense of this place in writing, and I admired his persistence.
zh_cn: 但我同情每个试图用写作理解这个国家的人，我欣赏他的坚持。

source: "I've experienced every kind of coldness and indifference from people," he told me once, "but I've also given myself knowledge, all the way up to the university level.
zh_cn: “虽然我经历了人们各种的冷眼和不屑”，他曾告诉我，“但我一直自学到大学程度。

source: I don't have a diploma.
zh_cn: 我没有文凭。

source: People look down on me when they see me."
zh_cn: 人们看不起我。”

source: A few weeks ago, Qi told me he had been reassigned to the sanitation department in another part of town; he said he would come back when he could.
zh_cn: 几个星期后前，戚相富告诉我他被环保部门调到城里的另一端去工作了；他说可以的话会再回来。

source: The last time I saw him, he wasn't wearing his uniform; he was in street clothes-a crisp white shirt and a black jacket-on his way to see his daughter who worked at a restaurant nearby.
zh_cn: 最后一次见到他的时候，他没有穿制服，穿了普通的纯色白衬衣和黑色夹克，是要去看他在附近餐馆打工的女儿。

source: He had a book under his arm: "Ten Contemporary Authors of Prose."
zh_cn: 他的臂下夹着一本书《十大当代散文家》。

source: For the first time, I saw the two personae, online and real-world, in one.
zh_cn: 头一回，我同时看见了他的两个人格，网上的和现实生活中的。

source: What inspires you, I once asked him.
zh_cn: 是什么激励着你？我曾经问他。

source: "When I write," he said, "anything becomes material.
zh_cn: “当我写作的时候”，他说，“一切都变成了我的素材。

source: In life, I must be practical, but when I write, it is up to me."
zh_cn: 虽然生活中我必须实际，但写作的时候，都由我决定。”
